# Data Wrangling with Pandas

In [1]:
import pandas as pd
import numpy as np

### Pandas -  Series and DataFrames

**Pandas Series**
* Pandas Series is a one-dimensional labeled array/list capable of holding data of any type (integer, string, float, python objects, etc.). 
* The labels are collectively called index. 
* Pandas Series can be thought as a single column of an excel spreadsheet and each entry in a series corresponds to an individual row in the spreadsheet.

In [2]:
# creating a list of price of different shoes
shoes_price_list = [75,55,65,50,80]

# converting the shoes_price_list to an array 
shoes_price_arr = np.array(shoes_price_list)

# converting the list and array into a Pandas Series object  
series_list = pd.Series(shoes_price_list)
series_arr = pd.Series(shoes_price_arr)

# printing the converted series object
print(series_list)
print(series_arr)

0    75
1    55
2    65
3    50
4    80
dtype: int64
0    75
1    55
2    65
3    50
4    80
dtype: int32

In [3]:
# changing the index of a series
index_list = ['Nike','Adidas','Skechers','Under Armour','Converse']
shoes_price_list_labeled = pd.Series(shoes_price_list, index = index_list)
print(shoes_price_list_labeled)

Nike            75
Adidas          55
Skechers        65
Under Armour    50
Converse        80
dtype: int64

**Performing mathematical operations on Pandas Series**

* The price of each shoes was increased by 10%. Let's increase the prices.

In [4]:
# adding 10% to existing prices
shoes_price_list_labeled_updated = shoes_price_list_labeled + 0.1*shoes_price_list_labeled
# or
#shoes_price_list_labeled_updated = 1.1*shoes_price_list_labeled
shoes_price_list_labeled_updated

Nike            82.5
Adidas          60.5
Skechers        71.5
Under Armour    55.0
Converse        88.0
dtype: float64

In [5]:
new_price_list = [90, 60, 75, 65, 95]
new_price_list_labeled = pd.Series(new_price_list, index = index_list)
print(new_price_list_labeled)

Nike            90
Adidas          60
Skechers        75
Under Armour    65
Converse        95
dtype: int64

In [6]:
print('Difference between new and old price')
price_diff = new_price_list_labeled - shoes_price_list_labeled_updated
print(price_diff)

Difference between new and old price
Nike             7.5
Adidas          -0.5
Skechers         3.5
Under Armour    10.0
Converse         7.0
dtype: float64

### Pandas DataFrame

Pandas DataFrame is a two-dimensional tabular data structure with labeled axes (rows and columns).

* Use lists to create a dataframe

In [7]:
# data by column
df_data=[[1900, '1-4 Years', 1983.8],
         [1901, '1-4 Years', 1695.0]]
# column headers
df_columns=['Year', 'Age Group', 'Death Rate']

In [8]:
# use pandas DataFrame constructor to create a dataframe
mortality_df = pd.DataFrame(data=df_data,columns=df_columns)

In [9]:
mortality_df

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0

* Use a dictionary to create a dataframe

In [10]:
# column header and data as key:value pairs in a dictionary
df_data_dict = {'Year':[1900,1901], 'Age Group':['1-4 Years','1-4 Year'], 'Death Rate':[1983.8,1695.0]}
df_data_dict

{'Year': [1900, 1901],
 'Age Group': ['1-4 Years', '1-4 Year'],
 'Death Rate': [1983.8, 1695.0]}

In [11]:
# use pandas DataFrame constructor to create a dataframe
mortality_df_dict = pd.DataFrame(data=df_data_dict)
mortality_df_dict

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901   1-4 Year      1695.0

### Read a CSV file from a website into a DataFrame

In [12]:
# use pandas read_csv function to load data from a csv file
mortality_url = "https://data.cdc.gov/api/views/v6ab-adf5/rows.csv?accessType=DOWNLOAD"
mortality_data = pd.read_csv(mortality_url)

In [14]:
mortality_data

     Year    Age Group  Death Rate
0    1900    1-4 Years      1983.8
1    1901    1-4 Years      1695.0
2    1902    1-4 Years      1655.7
3    1903    1-4 Years      1542.1
4    1904    1-4 Years      1591.5
..    ...          ...         ...
471  2014  15-19 Years        45.5
472  2015  15-19 Years        48.3
473  2016  15-19 Years        51.2
474  2017  15-19 Years        51.5
475  2018  15-19 Years        49.2

[476 rows x 3 columns]

### Save and restore a DataFrame

In [15]:
# save data to a csv file
mortality_data.to_csv('mortality_data.csv')

In [16]:
# load data from a pickle file
mortality_data = pd.read_csv('mortality_data.csv')

### Display the data

In [17]:
mortality_data

     Unnamed: 0  Year    Age Group  Death Rate
0             0  1900    1-4 Years      1983.8
1             1  1901    1-4 Years      1695.0
2             2  1902    1-4 Years      1655.7
3             3  1903    1-4 Years      1542.1
4             4  1904    1-4 Years      1591.5
..          ...   ...          ...         ...
471         471  2014  15-19 Years        45.5
472         472  2015  15-19 Years        48.3
473         473  2016  15-19 Years        51.2
474         474  2017  15-19 Years        51.5
475         475  2018  15-19 Years        49.2

[476 rows x 4 columns]

In [18]:
# use pandas head method to display data (first five rows by default)
mortality_data.head()

   Unnamed: 0  Year  Age Group  Death Rate
0           0  1900  1-4 Years      1983.8
1           1  1901  1-4 Years      1695.0
2           2  1902  1-4 Years      1655.7
3           3  1903  1-4 Years      1542.1
4           4  1904  1-4 Years      1591.5

In [19]:
mortality_data.head(10)

   Unnamed: 0  Year  Age Group  Death Rate
0           0  1900  1-4 Years      1983.8
1           1  1901  1-4 Years      1695.0
2           2  1902  1-4 Years      1655.7
3           3  1903  1-4 Years      1542.1
4           4  1904  1-4 Years      1591.5
5           5  1905  1-4 Years      1498.9
6           6  1906  1-4 Years      1580.0
7           7  1907  1-4 Years      1468.3
8           8  1908  1-4 Years      1396.8
9           9  1909  1-4 Years      1348.9

In [20]:
# display last five rows of data using pandas tail method
mortality_data.tail()

     Unnamed: 0  Year    Age Group  Death Rate
471         471  2014  15-19 Years        45.5
472         472  2015  15-19 Years        48.3
473         473  2016  15-19 Years        51.2
474         474  2017  15-19 Years        51.5
475         475  2018  15-19 Years        49.2

### Display the DataFrame attributes

In [21]:
# dataframe data as a numpy matrix
mortality_data.values

array([[0, 1900, '1-4 Years', 1983.8],
       [1, 1901, '1-4 Years', 1695.0],
       [2, 1902, '1-4 Years', 1655.7],
       ...,
       [473, 2016, '15-19 Years', 51.2],
       [474, 2017, '15-19 Years', 51.5],
       [475, 2018, '15-19 Years', 49.2]], dtype=object)

In [22]:
# index range
mortality_data.index

RangeIndex(start=0, stop=476, step=1)

In [23]:
# column headers
mortality_data.columns

Index(['Unnamed: 0', 'Year', 'Age Group', 'Death Rate'], dtype='object')

In [24]:
# size of the dataframe (rows x columns)
mortality_data.size

1904

In [25]:
# (# of rows, # of columns)
mortality_data.shape

(476, 4)

### Use the columns attribute to replace spaces with nothing

In [26]:
mortality_data.columns = mortality_data.columns.str.replace(' ', '')

In [27]:
mortality_data.columns

Index(['Unnamed:0', 'Year', 'AgeGroup', 'DeathRate'], dtype='object')

In [28]:
mortality_data.head()

   Unnamed:0  Year   AgeGroup  DeathRate
0          0  1900  1-4 Years     1983.8
1          1  1901  1-4 Years     1695.0
2          2  1902  1-4 Years     1655.7
3          3  1903  1-4 Years     1542.1
4          4  1904  1-4 Years     1591.5

### Use the info(), nunique(), and describe() methods

In [29]:
mortality_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476 entries, 0 to 475
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Unnamed:0  476 non-null    int64
 1   Year       476 non-null    int64
 2   AgeGroup   476 non-null    object
 3   DeathRate  476 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 15.0+ KB

In [30]:
mortality_data.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476 entries, 0 to 475
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Unnamed:0  476 non-null    int64
 1   Year       476 non-null    int64
 2   AgeGroup   476 non-null    object
 3   DeathRate  476 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 42.4 KB

In [31]:
mortality_data.nunique()

Unnamed:0    476
Year         119
AgeGroup       4
DeathRate    430
dtype: int64

In [32]:
mortality_data.describe()

        Unnamed:0         Year    DeathRate
count  476.000000   476.000000   476.000000
mean   237.500000  1959.000000   192.924160
std    137.553626    34.387268   293.224216
min      0.000000  1900.000000    11.400000
25%    118.750000  1929.000000    40.575000
50%    237.500000  1959.000000    89.500000
75%    356.250000  1989.000000   222.575000
max    475.000000  2018.000000  1983.800000

In [33]:
mortality_data['DeathRate']

0      1983.8
1      1695.0
2      1655.7
3      1542.1
4      1591.5
        ...
471      45.5
472      48.3
473      51.2
474      51.5
475      49.2
Name: DeathRate, Length: 476, dtype: float64

In [34]:
mortality_data.DeathRate

0      1983.8
1      1695.0
2      1655.7
3      1542.1
4      1591.5
        ...
471      45.5
472      48.3
473      51.2
474      51.5
475      49.2
Name: DeathRate, Length: 476, dtype: float64

In [35]:
mortality_data.describe()

        Unnamed:0         Year    DeathRate
count  476.000000   476.000000   476.000000
mean   237.500000  1959.000000   192.924160
std    137.553626    34.387268   293.224216
min      0.000000  1900.000000    11.400000
25%    118.750000  1929.000000    40.575000
50%    237.500000  1959.000000    89.500000
75%    356.250000  1989.000000   222.575000
max    475.000000  2018.000000  1983.800000

In [36]:
mortality_data.describe().T

,count,mean,std,min,25%,50%,75%,max
Unnamed:0,476.0,237.50000,137.553626,0.0,118.750,237.5,356.250,475.0
Year,476.0,1959.00000,34.387268,1900.0,1929.000,1959.0,1989.000,2018.0
DeathRate,476.0,192.92416,293.224216,11.4,40.575,89.5,222.575,1983.8

### Access columns

In [37]:
mortality_data.head()

   Unnamed:0  Year   AgeGroup  DeathRate
0          0  1900  1-4 Years     1983.8
1          1  1901  1-4 Years     1695.0
2          2  1902  1-4 Years     1655.7
3          3  1903  1-4 Years     1542.1
4          4  1904  1-4 Years     1591.5

In [38]:
mortality_data[['Year', 'AgeGroup']]

     Year     AgeGroup
0    1900    1-4 Years
1    1901    1-4 Years
2    1902    1-4 Years
3    1903    1-4 Years
4    1904    1-4 Years
..    ...          ...
471  2014  15-19 Years
472  2015  15-19 Years
473  2016  15-19 Years
474  2017  15-19 Years
475  2018  15-19 Years

[476 rows x 2 columns]

In [39]:
type(mortality_data['Year'])

pandas.core.series.Series

In [40]:
type(mortality_data[['Year','AgeGroup']])

pandas.core.frame.DataFrame

### Access the data

In [41]:
mortality_data.DeathRate.head(2)

0    1983.8
1    1695.0
Name: DeathRate, dtype: float64

In [42]:
type(mortality_data.DeathRate)

pandas.core.series.Series

In [43]:
mortality_data['DeathRate'].head(2)

0    1983.8
1    1695.0
Name: DeathRate, dtype: float64

In [44]:
mortality_data[['Year','DeathRate']].head(2)

   Year  DeathRate
0  1900     1983.8
1  1901     1695.0

In [45]:
type(mortality_data[['Year','DeathRate']])

pandas.core.frame.DataFrame

In [46]:
mortality_data.head()

   Unnamed:0  Year   AgeGroup  DeathRate
0          0  1900  1-4 Years     1983.8
1          1  1901  1-4 Years     1695.0
2          2  1902  1-4 Years     1655.7
3          3  1903  1-4 Years     1542.1
4          4  1904  1-4 Years     1591.5

### Access rows

In [47]:
# access the rows with a criteria on Year
mortality_data.query('Year==1900')

     Unnamed:0  Year     AgeGroup  DeathRate
0            0  1900    1-4 Years     1983.8
119        119  1900    5-9 Years      466.1
238        238  1900  10-14 Years      298.3
357        357  1900  15-19 Years      484.8

In [48]:
# access the rows with a criteria on Year and AgeGroup
mortality_data.query('Year == 2000 and AgeGroup != "1-4 Years"')

     Unnamed:0  Year     AgeGroup  DeathRate
219        219  2000    5-9 Years       15.8
338        338  2000  10-14 Years       20.3
457        457  2000  15-19 Years       67.1

In [49]:
mortality_data.query('Year == 1900 or Year == 2000').head()

     Unnamed:0  Year     AgeGroup  DeathRate
0            0  1900    1-4 Years     1983.8
100        100  2000    1-4 Years       32.4
119        119  1900    5-9 Years      466.1
219        219  2000    5-9 Years       15.8
238        238  1900  10-14 Years      298.3

In [ ]:
# use backticks if a column name contains spaces
# mortality_data.query('Year == 2000 and `Age Group` != "1-4 Years"')

### Access a subset of rows and columns

In [50]:
mortality_data.query('Year == 1900').DeathRate.head()

0      1983.8
119     466.1
238     298.3
357     484.8
Name: DeathRate, dtype: float64

In [51]:
mortality_data.query('Year == 1900')['DeathRate'].head()

0      1983.8
119     466.1
238     298.3
357     484.8
Name: DeathRate, dtype: float64

In [52]:
mortality_data.query('Year == 1900')[['DeathRate']].head()

     DeathRate
0       1983.8
119      466.1
238      298.3
357      484.8

In [53]:
mortality_data.query('Year == 1900')[['AgeGroup','DeathRate']].head()

        AgeGroup  DeathRate
0      1-4 Years     1983.8
119    5-9 Years      466.1
238  10-14 Years      298.3
357  15-19 Years      484.8

In [54]:
mortality_data.head(15)

    Unnamed:0  Year   AgeGroup  DeathRate
0           0  1900  1-4 Years     1983.8
1           1  1901  1-4 Years     1695.0
2           2  1902  1-4 Years     1655.7
3           3  1903  1-4 Years     1542.1
4           4  1904  1-4 Years     1591.5
5           5  1905  1-4 Years     1498.9
6           6  1906  1-4 Years     1580.0
7           7  1907  1-4 Years     1468.3
8           8  1908  1-4 Years     1396.8
9           9  1909  1-4 Years     1348.9
10         10  1910  1-4 Years     1397.3
11         11  1911  1-4 Years     1176.0
12         12  1912  1-4 Years     1094.1
13         13  1913  1-4 Years     1193.4
14         14  1914  1-4 Years     1024.2

### Access rows with the loc[] accessor

**loc method**

* loc is a  method to access rows and columns on pandas objects. When using the loc method on a dataframe, we specify which rows and which columns we want by using the following format:

  * **dataframe.loc[row selection, column selection]**

* DataFrame.loc[] method is a method that takes **only index labels** and returns row or dataframe if the index label exists in the data frame.

In [55]:
# accessing first index row using loc method (indexing starts from 0 in python)
mortality_data.loc[1]

Unnamed:0            1
Year              1901
AgeGroup     1-4 Years
DeathRate       1695.0
Name: 1, dtype: object

In [56]:
# accessing 5th and 15th index rows
mortality_data.loc[[5,15]]

    Unnamed:0  Year   AgeGroup  DeathRate
5           5  1905  1-4 Years     1498.9
15         15  1915  1-4 Years      924.2

In [57]:
# accessing 4th through 15th index rows
# different than regular python indexing. start:stop both inclusive
mortality_data.loc[4:15]

    Unnamed:0  Year   AgeGroup  DeathRate
4           4  1904  1-4 Years     1591.5
5           5  1905  1-4 Years     1498.9
6           6  1906  1-4 Years     1580.0
7           7  1907  1-4 Years     1468.3
8           8  1908  1-4 Years     1396.8
9           9  1909  1-4 Years     1348.9
10         10  1910  1-4 Years     1397.3
11         11  1911  1-4 Years     1176.0
12         12  1912  1-4 Years     1094.1
13         13  1913  1-4 Years     1193.4
14         14  1914  1-4 Years     1024.2
15         15  1915  1-4 Years      924.2

In [58]:
# accessing 0th through 20th index rows with a step size of 5
mortality_data.loc[0:20:5]

    Unnamed:0  Year   AgeGroup  DeathRate
0           0  1900  1-4 Years     1983.8
5           5  1905  1-4 Years     1498.9
10         10  1910  1-4 Years     1397.3
15         15  1915  1-4 Years      924.2
20         20  1920  1-4 Years      987.2

In [59]:
# accessing rows where Year=1917
mortality_data.loc[mortality_data.Year == 1917]

     Unnamed:0  Year     AgeGroup  DeathRate
17          17  1917    1-4 Years     1066.0
136        136  1917    5-9 Years      290.7
255        255  1917  10-14 Years      218.9
374        374  1917  15-19 Years      380.3

### Access rows and columns with the loc[] accessor

In [60]:
# accessing rows 0 through 5 and columns Year and DeathRate
mortality_data.loc[0:5, ['Year', 'DeathRate']]

   Year  DeathRate
0  1900     1983.8
1  1901     1695.0
2  1902     1655.7
3  1903     1542.1
4  1904     1591.5
5  1905     1498.9

In [61]:
# accessing rows 0, 5, and 10 and columns AgeGroup and DeathRate
mortality_data.loc[[0,5,10],['AgeGroup','DeathRate']]

     AgeGroup  DeathRate
0   1-4 Years     1983.8
5   1-4 Years     1498.9
10  1-4 Years     1397.3

In [62]:
# accessing rows 4 through 6 and columns AgeGroup and DeathRate
mortality_data.loc[4:6,'AgeGroup':'DeathRate']

    AgeGroup  DeathRate
4  1-4 Years     1591.5
5  1-4 Years     1498.9
6  1-4 Years     1580.0

In [63]:
mortality_data.head(15)

    Unnamed:0  Year   AgeGroup  DeathRate
0           0  1900  1-4 Years     1983.8
1           1  1901  1-4 Years     1695.0
2           2  1902  1-4 Years     1655.7
3           3  1903  1-4 Years     1542.1
4           4  1904  1-4 Years     1591.5
5           5  1905  1-4 Years     1498.9
6           6  1906  1-4 Years     1580.0
7           7  1907  1-4 Years     1468.3
8           8  1908  1-4 Years     1396.8
9           9  1909  1-4 Years     1348.9
10         10  1910  1-4 Years     1397.3
11         11  1911  1-4 Years     1176.0
12         12  1912  1-4 Years     1094.1
13         13  1913  1-4 Years     1193.4
14         14  1914  1-4 Years     1024.2

### How to access rows and columns with the iloc[] accessor

**iloc method**

* The iloc indexer for Pandas Dataframe is used for **integer location-based** indexing/selection by position. When using the loc method on a dataframe, we specify which rows and which columns we want by using the following format:

  * **dataframe.iloc[row selection, column selection]**

In [64]:
# accessing selected rows and columns using iloc method 
mortality_data.iloc[[4,5,6],[1,2]]

   Year   AgeGroup
4  1904  1-4 Years
5  1905  1-4 Years
6  1906  1-4 Years

In [65]:
mortality_data.iloc[4:7,1:3]

   Year   AgeGroup
4  1904  1-4 Years
5  1905  1-4 Years
6  1906  1-4 Years

In [66]:
# accessing last 10 rows
mortality_data.iloc[-10:]

     Unnamed:0  Year     AgeGroup  DeathRate
466        466  2009  15-19 Years       51.9
467        467  2010  15-19 Years       49.4
468        468  2011  15-19 Years       48.9
469        469  2012  15-19 Years       47.2
470        470  2013  15-19 Years       44.8
471        471  2014  15-19 Years       45.5
472        472  2015  15-19 Years       48.3
473        473  2016  15-19 Years       51.2
474        474  2017  15-19 Years       51.5
475        475  2018  15-19 Years       49.2

In [67]:
# accessing the data in a reverse order
mortality_data.iloc[::-1] # also works for .loc method

     Unnamed:0  Year     AgeGroup  DeathRate
475        475  2018  15-19 Years       49.2
474        474  2017  15-19 Years       51.5
473        473  2016  15-19 Years       51.2
472        472  2015  15-19 Years       48.3
471        471  2014  15-19 Years       45.5
..         ...   ...          ...        ...
4            4  1904    1-4 Years     1591.5
3            3  1903    1-4 Years     1542.1
2            2  1902    1-4 Years     1655.7
1            1  1901    1-4 Years     1695.0
0            0  1900    1-4 Years     1983.8

[476 rows x 4 columns]

**Difference between loc and iloc indexing methods**

* loc is label-based, which means that you have to specify rows and columns based on their row and column labels.
* iloc is integer position-based, so you have to specify rows and columns by their integer position values (0-based integer position).

If we use labels instead of index values in .iloc it will throw an error.

In [68]:
# accessing selected rows and columns using iloc method 
mortality_data.iloc[[1,4],['AgeGroup','DeathRate']]

IndexError: .iloc requires numeric indexers, got ['AgeGroup' 'DeathRate']

#### Different ways of doing the same thing

**Access all the rows in the dataframe mortality_data where Year is 1900**

* using .query method

In [69]:
mortality_data.query('Year==1900')

     Unnamed:0  Year     AgeGroup  DeathRate
0            0  1900    1-4 Years     1983.8
119        119  1900    5-9 Years      466.1
238        238  1900  10-14 Years      298.3
357        357  1900  15-19 Years      484.8

* using .loc method

In [70]:
mortality_data.loc[mortality_data['Year']==1900]

     Unnamed:0  Year     AgeGroup  DeathRate
0            0  1900    1-4 Years     1983.8
119        119  1900    5-9 Years      466.1
238        238  1900  10-14 Years      298.3
357        357  1900  15-19 Years      484.8

* using [ ] method

In [71]:
mortality_data[mortality_data['Year']==1900]

     Unnamed:0  Year     AgeGroup  DeathRate
0            0  1900    1-4 Years     1983.8
119        119  1900    5-9 Years      466.1
238        238  1900  10-14 Years      298.3
357        357  1900  15-19 Years      484.8

**Access all the rows in the dataframe mortality_data where Year is 2000 and AgeGroup is not equal to 1-4 Years**

In [72]:
# using .query method
print('Using .query method')
display(mortality_data.query('Year == 2000 and AgeGroup != "1-4 Years"'))

# using .loc method
print('Using .loc method')
display(mortality_data.loc[(mortality_data['Year']==2000) & (mortality_data['AgeGroup']!='1-4 Years')])

# using [ ] method
print('Using [] method')
display(mortality_data[(mortality_data['Year']==2000) & (mortality_data['AgeGroup']!='1-4 Years')])

Using .query method

     Unnamed:0  Year     AgeGroup  DeathRate
219        219  2000    5-9 Years       15.8
338        338  2000  10-14 Years       20.3
457        457  2000  15-19 Years       67.1

Using .loc method

     Unnamed:0  Year     AgeGroup  DeathRate
219        219  2000    5-9 Years       15.8
338        338  2000  10-14 Years       20.3
457        457  2000  15-19 Years       67.1

Using [] method

     Unnamed:0  Year     AgeGroup  DeathRate
219        219  2000    5-9 Years       15.8
338        338  2000  10-14 Years       20.3
457        457  2000  15-19 Years       67.1

### Sort the data

In [73]:
# sort the dataframe by DeathRate (ascending by default)
mortality_data.sort_values('DeathRate').head(3)

     Unnamed:0  Year   AgeGroup  DeathRate
231        231  2012  5-9 Years       11.4
237        237  2018  5-9 Years       11.5
229        229  2010  5-9 Years       11.5

In [74]:
# sort the dataframe by Year and DeathRate
mortality_data.sort_values(['Year','DeathRate']).head(10)

     Unnamed:0  Year     AgeGroup  DeathRate
238        238  1900  10-14 Years      298.3
119        119  1900    5-9 Years      466.1
357        357  1900  15-19 Years      484.8
0            0  1900    1-4 Years     1983.8
239        239  1901  10-14 Years      273.6
120        120  1901    5-9 Years      427.6
358        358  1901  15-19 Years      454.4
1            1  1901    1-4 Years     1695.0
240        240  1902  10-14 Years      252.5
121        121  1902    5-9 Years      403.3

In [75]:
# sor the dataframe by Year in ascending order, and AgeGroup by descending order
mortality_data.sort_values(['Year','AgeGroup'], ascending=[True,False]).head(10)

     Unnamed:0  Year     AgeGroup  DeathRate
119        119  1900    5-9 Years      466.1
357        357  1900  15-19 Years      484.8
238        238  1900  10-14 Years      298.3
0            0  1900    1-4 Years     1983.8
120        120  1901    5-9 Years      427.6
358        358  1901  15-19 Years      454.4
239        239  1901  10-14 Years      273.6
1            1  1901    1-4 Years     1695.0
121        121  1902    5-9 Years      403.3
359        359  1902  15-19 Years      421.5

### Apply statistical methods

In [76]:
# compute the mean of the DeathRate column
mortality_data.DeathRate.mean()

192.92415966386568

In [77]:
# compute the standard deviations of Year and DeathRate columns
mortality_data[['Year','DeathRate']].std()

Year          34.387268
DeathRate    293.224216
dtype: float64

In [78]:
# count the number of row in each column
mortality_data.count()

Unnamed:0    476
Year         476
AgeGroup     476
DeathRate    476
dtype: int64

In [79]:
# compute the specified percentiles (will be applied to numerical columns only)
mortality_data.quantile([.1,.9])

     Unnamed:0    Year  DeathRate
0.1       47.5  1911.5      21.50
0.9      427.5  2006.5     430.85

In [80]:
# calculate the cumulative sum of the DeathRate column
mortality_data.DeathRate.cumsum()

0       1983.8
1       3678.8
2       5334.5
3       6876.6
4       8468.1
        ...
471    91631.7
472    91680.0
473    91731.2
474    91782.7
475    91831.9
Name: DeathRate, Length: 476, dtype: float64

In [81]:
mortality_data

     Unnamed:0  Year     AgeGroup  DeathRate
0            0  1900    1-4 Years     1983.8
1            1  1901    1-4 Years     1695.0
2            2  1902    1-4 Years     1655.7
3            3  1903    1-4 Years     1542.1
4            4  1904    1-4 Years     1591.5
..         ...   ...          ...        ...
471        471  2014  15-19 Years       45.5
472        472  2015  15-19 Years       48.3
473        473  2016  15-19 Years       51.2
474        474  2017  15-19 Years       51.5
475        475  2018  15-19 Years       49.2

[476 rows x 4 columns]

In [82]:
# create a new column DeathRate_per100 by dividing the existing column DeathRate by 100
mortality_data['DeathRate_per100'] = mortality_data['DeathRate']/100

In [83]:
mortality_data.head()

   Unnamed:0  Year   AgeGroup  DeathRate  DeathRate_per100
0          0  1900  1-4 Years     1983.8            19.838
1          1  1901  1-4 Years     1695.0            16.950
2          2  1902  1-4 Years     1655.7            16.557
3          3  1903  1-4 Years     1542.1            15.421
4          4  1904  1-4 Years     1591.5            15.915

### Use Python for column arithmetic

In [84]:
# create a new column MeanCentered by subtracting the mean of DeathRate from the DeathRate column
mortality_data['MeanCentered'] = mortality_data.DeathRate - mortality_data.DeathRate.mean()

In [85]:
mortality_data.head(4)

   Unnamed:0  Year   AgeGroup  DeathRate  DeathRate_per100  MeanCentered
0          0  1900  1-4 Years     1983.8            19.838    1790.87584
1          1  1901  1-4 Years     1695.0            16.950    1502.07584
2          2  1902  1-4 Years     1655.7            16.557    1462.77584
3          3  1903  1-4 Years     1542.1            15.421    1349.17584

In [86]:
mortality_data['DeathRate'] = mortality_data.DeathRate / 100000

In [87]:
mortality_data.head(4)

   Unnamed:0  Year   AgeGroup  DeathRate  DeathRate_per100  MeanCentered
0          0  1900  1-4 Years   0.019838            19.838    1790.87584
1          1  1901  1-4 Years   0.016950            16.950    1502.07584
2          2  1902  1-4 Years   0.016557            16.557    1462.77584
3          3  1903  1-4 Years   0.015421            15.421    1349.17584

### Modify the string data in a column

In [88]:
mortality_data.AgeGroup.unique()

array(['1-4 Years', '5-9 Years', '10-14 Years', '15-19 Years'],
      dtype=object)

In [89]:
# with the Pandas replace() method with three parameters
mortality_data.AgeGroup.replace(
                                to_replace = ['1-4 Years','5-9 Years'],
                                value = ['01-04 Years','05-09 Years'],
                                inplace = True)

# or

# without using the inplace parameter
#mortality_data.AgeGroup = mortality_data.AgeGroup.replace(
#                                                to_replace = ['1-4 Years','5-9 Years'],
#                                                value = ['01-04 Years','05-09 Years'])

# or

# with the Pandas replace() method and a dictionary of old and new values
# mortality_data.AgeGroup.replace(
#                               {'1-4 Years':'01-04 Years','5-9 Years':'05-09 Years'},
#                               inplace = True)

In [90]:
mortality_data.head(10)

   Unnamed:0  Year     AgeGroup  DeathRate  DeathRate_per100  MeanCentered
0          0  1900  01-04 Years   0.019838            19.838    1790.87584
1          1  1901  01-04 Years   0.016950            16.950    1502.07584
2          2  1902  01-04 Years   0.016557            16.557    1462.77584
3          3  1903  01-04 Years   0.015421            15.421    1349.17584
4          4  1904  01-04 Years   0.015915            15.915    1398.57584
5          5  1905  01-04 Years   0.014989            14.989    1305.97584
6          6  1906  01-04 Years   0.015800            15.800    1387.07584
7          7  1907  01-04 Years   0.014683            14.683    1275.37584
8          8  1908  01-04 Years   0.013968            13.968    1203.87584
9          9  1909  01-04 Years   0.013489            13.489    1155.97584

In [91]:
# with the Python replace() method
mortality_data['AgeGroup'] = mortality_data.AgeGroup.str.replace('1-4 Years', '01-04 Years')
mortality_data['AgeGroup'] = mortality_data.AgeGroup.str.replace('5-9 Years', '05-09 Years')

### Set and use an index

In [92]:
# set the Year column as the new index (will replace the default index by Year)
mortality_data = mortality_data.set_index('Year')
mortality_data.head(2)

      Unnamed:0     AgeGroup  DeathRate  DeathRate_per100  MeanCentered
Year
1900          0  01-04 Years   0.019838            19.838    1790.87584
1901          1  01-04 Years   0.016950            16.950    1502.07584

In [93]:
# reset the index to the default indexing (the old index will be brought into the dataframe as a column)
mortality_data.reset_index(inplace=True)

In [94]:
mortality_data

     Year  Unnamed:0     AgeGroup  DeathRate  DeathRate_per100  MeanCentered
0    1900          0  01-04 Years   0.019838            19.838    1790.87584
1    1901          1  01-04 Years   0.016950            16.950    1502.07584
2    1902          2  01-04 Years   0.016557            16.557    1462.77584
3    1903          3  01-04 Years   0.015421            15.421    1349.17584
4    1904          4  01-04 Years   0.015915            15.915    1398.57584
..    ...        ...          ...        ...               ...           ...
471  2014        471  15-19 Years   0.000455             0.455    -147.42416
472  2015        472  15-19 Years   0.000483             0.483    -144.62416
473  2016        473  15-19 Years   0.000512             0.512    -141.72416
474  2017        474  15-19 Years   0.000515             0.515    -141.42416
475  2018        475  15-19 Years   0.000492             0.492    -143.72416

[476 rows x 6 columns]

In [95]:
# NOTE: the following line of code causes ValueError: Index has duplicate keys
mortality_data = mortality_data.set_index('Year', verify_integrity=True)

ValueError: Index has duplicate keys: Int64Index([1900, 1901, 1902, 1903, 1904, 1905, 1906, 1907, 1908, 1909,
            ...
            2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018],
           dtype='int64', name='Year', length=119)

In [96]:
# setting multiple columns as index
mortality_data = mortality_data.set_index(['Year','AgeGroup'], verify_integrity=True)
mortality_data.head(2)

                  Unnamed:0  DeathRate  DeathRate_per100  MeanCentered
Year AgeGroup
1900 01-04 Years          0   0.019838            19.838    1790.87584
1901 01-04 Years          1   0.016950            16.950    1502.07584

In [97]:
mortality_data.reset_index(inplace=True)
mortality_data.tail(20)

     Year     AgeGroup  Unnamed:0  DeathRate  DeathRate_per100  MeanCentered
456  1999  15-19 Years        456   0.000686             0.686    -124.32416
457  2000  15-19 Years        457   0.000671             0.671    -125.82416
458  2001  15-19 Years        458   0.000663             0.663    -126.62416
459  2002  15-19 Years        459   0.000670             0.670    -125.92416
460  2003  15-19 Years        460   0.000654             0.654    -127.52416
461  2004  15-19 Years        461   0.000649             0.649    -128.02416
462  2005  15-19 Years        462   0.000638             0.638    -129.12416
463  2006  15-19 Years        463   0.000630             0.630    -129.92416
464  2007  15-19 Years        464   0.000603             0.603    -132.62416
465  2008  15-19 Years        465   0.000559             0.559    -137.02416
466  2009  15-19 Years        466   0.000519             0.519    -141.02416
467  2010  15-19 Years        467   0.000494             0.494    -143.52416
468  2011  15-19 Years        468   0.000489             0.489    -144.02416
469  2012  15-19 Years        469   0.000472             0.472    -145.72416
470  2013  15-19 Years        470   0.000448             0.448    -148.12416
471  2014  15-19 Years        471   0.000455             0.455    -147.42416
472  2015  15-19 Years        472   0.000483             0.483    -144.62416
473  2016  15-19 Years        473   0.000512             0.512    -141.72416
474  2017  15-19 Years        474   0.000515             0.515    -141.42416
475  2018  15-19 Years        475   0.000492             0.492    -143.72416

### Group the data

In [98]:
mortality_data.head()

   Year     AgeGroup  Unnamed:0  DeathRate  DeathRate_per100  MeanCentered
0  1900  01-04 Years          0   0.019838            19.838    1790.87584
1  1901  01-04 Years          1   0.016950            16.950    1502.07584
2  1902  01-04 Years          2   0.016557            16.557    1462.77584
3  1903  01-04 Years          3   0.015421            15.421    1349.17584
4  1904  01-04 Years          4   0.015915            15.915    1398.57584

In [99]:
# group the data on the AgeGroup column (mean will be calculated for all remaining numeric columns in the dataframe)
mortality_data.groupby('AgeGroup').mean()

               Year  Unnamed:0  DeathRate  DeathRate_per100  MeanCentered
AgeGroup
01-04 Years  1959.0       59.0   0.003832          3.832261    190.301891
05-09 Years  1959.0      178.0   0.001173          1.173261    -75.598109
10-14 Years  1959.0      297.0   0.000938          0.937697    -99.154412
15-19 Years  1959.0      416.0   0.001774          1.773748    -15.549370

In [100]:
# group the data on the AgeGroup column (select the aggregated data only for 'DeathRate' column)
mortality_data.groupby('AgeGroup').mean()[['DeathRate']]

             DeathRate
AgeGroup
01-04 Years   0.003832
05-09 Years   0.001173
10-14 Years   0.000938
15-19 Years   0.001774

In [101]:
# pre-specify the column(s) you want to groupby and aggregate on and then do groupby and aggreration
mortality_data[['AgeGroup','DeathRate']].groupby('AgeGroup').mean()

             DeathRate
AgeGroup
01-04 Years   0.003832
05-09 Years   0.001173
10-14 Years   0.000938
15-19 Years   0.001774

In [102]:
# group the data on the Year column
mortality_data.groupby('Year').median()

      Unnamed:0  DeathRate  DeathRate_per100  MeanCentered
Year
1900      178.5   0.004755            4.7545     282.52584
1901      179.5   0.004410            4.4100     248.07584
1902      180.5   0.004124            4.1240     219.47584
1903      181.5   0.004244            4.2440     231.47584
1904      182.5   0.004482            4.4820     255.27584
...         ...        ...               ...           ...
2014      292.5   0.000190            0.1900    -173.92416
2015      293.5   0.000197            0.1975    -173.17416
2016      294.5   0.000200            0.1995    -172.97416
2017      295.5   0.000199            0.1990    -173.02416
2018      296.5   0.000195            0.1945    -173.47416

[119 rows x 4 columns]

In [103]:
# group the data on multiple columns
mortality_data.groupby(['Year','AgeGroup']).count().head()

                  Unnamed:0  DeathRate  DeathRate_per100  MeanCentered
Year AgeGroup
1900 01-04 Years          1          1                 1             1
     05-09 Years          1          1                 1             1
     10-14 Years          1          1                 1             1
     15-19 Years          1          1                 1             1
1901 01-04 Years          1          1                 1             1

### Aggregate the data

In [104]:
# aggregate the data for all columns in each age group
mortality_data.groupby('AgeGroup').agg(['mean','median'])

               Year         Unnamed:0        DeathRate            \
               mean  median      mean median      mean    median
AgeGroup
01-04 Years  1959.0  1959.0      59.0   59.0  0.003832  0.001091
05-09 Years  1959.0  1959.0     178.0  178.0  0.001173  0.000484
10-14 Years  1959.0  1959.0     297.0  297.0  0.000938  0.000446
15-19 Years  1959.0  1959.0     416.0  416.0  0.001774  0.001069

            DeathRate_per100        MeanCentered
                        mean median         mean     median
AgeGroup
01-04 Years         3.832261  1.091   190.301891  -83.82416
05-09 Years         1.173261  0.484   -75.598109 -144.52416
10-14 Years         0.937697  0.446   -99.154412 -148.32416
15-19 Years         1.773748  1.069   -15.549370  -86.02416

In [105]:
# aggregate the data for just the death rate in each age group
mortality_data[['AgeGroup','DeathRate']] \
        .groupby('AgeGroup') \
        .agg(['mean','median','std','nunique'])

            DeathRate
                 mean    median       std nunique
AgeGroup
01-04 Years  0.003832  0.001091  0.005005     117
05-09 Years  0.001173  0.000484  0.001275     115
10-14 Years  0.000938  0.000446  0.000884     115
15-19 Years  0.001774  0.001069  0.001384     117

In [106]:
# aggregate the data for just the death rate in each year group
mortality_data.groupby('Year')['DeathRate'] \
    .agg(['mean','median','std','min','max','var','nunique']).head(3)

          mean    median       std       min       max       var  nunique
Year
1900  0.008082  0.004755  0.007882  0.002983  0.019838  0.000062        4
1901  0.007127  0.004410  0.006597  0.002736  0.016950  0.000044        4
1902  0.006833  0.004124  0.006527  0.002525  0.016557  0.000043        4

### Drop columns

In [107]:
mortality_data.head()

   Year     AgeGroup  Unnamed:0  DeathRate  DeathRate_per100  MeanCentered
0  1900  01-04 Years          0   0.019838            19.838    1790.87584
1  1901  01-04 Years          1   0.016950            16.950    1502.07584
2  1902  01-04 Years          2   0.016557            16.557    1462.77584
3  1903  01-04 Years          3   0.015421            15.421    1349.17584
4  1904  01-04 Years          4   0.015915            15.915    1398.57584

In [108]:
# drop a single column
mortality_data = mortality_data.drop(columns='Unnamed:0')

In [109]:
mortality_data.head()

   Year     AgeGroup  DeathRate  DeathRate_per100  MeanCentered
0  1900  01-04 Years   0.019838            19.838    1790.87584
1  1901  01-04 Years   0.016950            16.950    1502.07584
2  1902  01-04 Years   0.016557            16.557    1462.77584
3  1903  01-04 Years   0.015421            15.421    1349.17584
4  1904  01-04 Years   0.015915            15.915    1398.57584

In [110]:
# drop multiple columns at once
mortality_data = mortality_data.drop(columns=['DeathRate_per100','MeanCentered'])

# or

#mortality_data.drop(columns=['DeathRate_per100','MeanCentered'], inplace=True)
mortality_data.head()

   Year     AgeGroup  DeathRate
0  1900  01-04 Years   0.019838
1  1901  01-04 Years   0.016950
2  1902  01-04 Years   0.016557
3  1903  01-04 Years   0.015421
4  1904  01-04 Years   0.015915

### Rename columns

In [111]:
# rename AgeGroup to Age_Group and DeathRate to Death_Rate using pandas rename() method
mortality_data = mortality_data.rename(columns={'AgeGroup':'Age_Group',
                                                'DeathRate':'Death_Rate'})
mortality_data.head()

   Year    Age_Group  Death_Rate
0  1900  01-04 Years    0.019838
1  1901  01-04 Years    0.016950
2  1902  01-04 Years    0.016557
3  1903  01-04 Years    0.015421
4  1904  01-04 Years    0.015915

In [112]:
mortality_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476 entries, 0 to 475
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        476 non-null    int64
 1   Age_Group   476 non-null    object
 2   Death_Rate  476 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.3+ KB

### Handling missing data

In [116]:
random_index = list(set(np.random.randint(0,mortality_data.shape[0]+1, size=5)))
print(random_index)

[395, 396, 301, 339, 123]

In [117]:
mortality_data.loc[random_index,'Year']

395    1938
396    1939
301    1963
339    2001
123    1904
Name: Year, dtype: int64

In [118]:
# create a list of 5 or less random integer in the range(0,#rows+1)
random_index = list(set(np.random.randint(0,mortality_data.shape[0]+1, size=5)))
print(random_index)
# use the index from above to create some missing data in 'Year' column
mortality_data.loc[random_index,'Year']=np.NaN

random_index = list(set(np.random.randint(0,mortality_data.shape[0]+1, size=5)))
print(random_index)
# create some missing values in 'DeathRate' column as well
mortality_data.loc[random_index,'Death_Rate']=np.NaN

mortality_data.head()

[209, 407, 408, 183, 283]
[2, 322, 326, 242, 184]

     Year    Age_Group  Death_Rate
0  1900.0  01-04 Years    0.019838
1  1901.0  01-04 Years    0.016950
2  1902.0  01-04 Years         NaN
3  1903.0  01-04 Years    0.015421
4  1904.0  01-04 Years    0.015915

In [119]:
# count the missing values in each column
missing_count = mortality_data.shape[0] - mortality_data.count()
print(missing_count)

Year          5
Age_Group     0
Death_Rate    5
dtype: int64

In [120]:
# get all the rows that have any missing values (in any column)
mortality_data[mortality_data.isnull().any(axis=1)]

       Year    Age_Group  Death_Rate
2    1902.0  01-04 Years         NaN
183     NaN  05-09 Years    0.000446
184  1965.0  05-09 Years         NaN
209     NaN  05-09 Years    0.000222
242  1904.0  10-14 Years         NaN
283     NaN  10-14 Years    0.000868
322  1984.0  10-14 Years         NaN
326  1988.0  10-14 Years         NaN
407     NaN  15-19 Years    0.001086
408     NaN  15-19 Years    0.001089

In [121]:
# get all the rows with missing values in 'DeathRate' column
mortality_data[mortality_data.Death_Rate.isnull()]

       Year    Age_Group  Death_Rate
2    1902.0  01-04 Years         NaN
184  1965.0  05-09 Years         NaN
242  1904.0  10-14 Years         NaN
322  1984.0  10-14 Years         NaN
326  1988.0  10-14 Years         NaN

In [122]:
# get all the rows with no missing values in 'DeathRate' column
mortality_data[mortality_data.Death_Rate.notnull()]

       Year    Age_Group  Death_Rate
0    1900.0  01-04 Years    0.019838
1    1901.0  01-04 Years    0.016950
3    1903.0  01-04 Years    0.015421
4    1904.0  01-04 Years    0.015915
5    1905.0  01-04 Years    0.014989
..      ...          ...         ...
471  2014.0  15-19 Years    0.000455
472  2015.0  15-19 Years    0.000483
473  2016.0  15-19 Years    0.000512
474  2017.0  15-19 Years    0.000515
475  2018.0  15-19 Years    0.000492

[471 rows x 3 columns]

In [123]:
# drop all the rows that have missing values in the 'Death_Rate' column
mortality_data = mortality_data.dropna(subset=['Death_Rate'])

In [124]:
missing_count = mortality_data.shape[0] - mortality_data.count()
print(missing_count)

Year          5
Age_Group     0
Death_Rate    0
dtype: int64

In [125]:
# drop all the rows that have missing values in any column
mortality_data = mortality_data.dropna()

# or

#mortality_data.dropna(inplace=True)

In [126]:
missing_count = mortality_data.shape[0] - mortality_data.count()
print(missing_count)

Year          0
Age_Group     0
Death_Rate    0
dtype: int64

In [128]:
mortality_data.shape

(466, 3)

In [129]:
# let's reload the data and create some missing values once again
mortality_data = pd.read_csv(mortality_url)
mortality_data = mortality_data.rename(columns={'Age Group':'Age_Group',
                                                'Death Rate':'Death_Rate'})
random_index = list(set(np.random.randint(0,mortality_data.shape[0]+1, size=10)))
mortality_data.loc[random_index,'Death_Rate']=np.NaN

missing_count = mortality_data.shape[0] - mortality_data.count()
print(missing_count)

Year           0
Age_Group      0
Death_Rate    10
dtype: int64

In [130]:
mortality_data.loc[[random_index[0]-1, random_index[0], random_index[0]+1]]

     Year  Age_Group  Death_Rate
192  1973  5-9 Years        41.1
193  1974  5-9 Years         NaN
194  1975  5-9 Years        35.2

In [131]:
# replace missing values with mean/median etc.
mortality_data.Death_Rate.fillna(value=mortality_data.Death_Rate.mean(), inplace=True)

missing_count = mortality_data.shape[0] - mortality_data.count()
print(missing_count)

Year          0
Age_Group     0
Death_Rate    0
dtype: int64

In [132]:
mortality_data.shape

(476, 3)

In [133]:
mortality_data.loc[[random_index[0]-1, random_index[0], random_index[0]+1]]

     Year  Age_Group  Death_Rate
192  1973  5-9 Years   41.100000
193  1974  5-9 Years  194.454506
194  1975  5-9 Years   35.200000